force-app/main/default/classes/B2B_VertexTaxCalculationCalloutMock.cls

/*************************************************************
Name: B2B_VertexTaxCalculationCalloutMock
Business Unit:HDM
Date : 21/06/2021
Developer: Raj Rishi Kaushik
Description: This class is to provide mock response to API callout made from test class,Mock class for B2B_VertexTaxCalculationIntegration and B2B_BTVertexTaxCalculationIntegration.
MODIFICATIONS- 06/02/2022 |Palak Gupta
MODIFICATIONS – 09/06/2022 | Mathioli | (Added header and removal of commented code) 
*************************************************************/
@isTest
global class B2B_VertexTaxCalculationCalloutMock implements HttpCalloutMock {
	 global HTTPResponse respond(HTTPRequest request) {
        // Create a fake response
        HttpResponse response = new HttpResponse();
        response.setHeader('Content-Type', 'text/xml');
        String reqBody = request.getBody();
         //negative response 
         if(reqBody.contains('<urn:Division>123456</urn:Division>')){
            String body = '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><soapenv:Fault><faultcode>soapenv:Client</faultcode><faultstring xml:lang="en">Unexpected close tag &lt;/urn:Seller>; expected &lt;/urn:InvoiceRequest>.&#xd;at [row,col {unknown-source}]: [22,14]</faultstring><detail><ns2:VertexException xmlns:ns2="urn:vertexinc:oseries:exception:1:0">';
         	body += '<exceptionType>WstxParsingException</exceptionType><rootCause>com.ctc.wstx.exc.WstxParsingException: Unexpected close tag &lt;/urn:Seller>; expected &lt;/urn:InvoiceRequest>.&#xd;at [row,col {unknown-source}]: [22,14]</rootCause></ns2:VertexException></detail></soapenv:Fault></soapenv:Body></soapenv:Envelope>';
         	response.setBody(body); 
         }//positive response 
         else if(reqBody.contains('QuotationRequest')){
             String body = '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:9:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId>******</TrustedId></Login><QuotationResponse documentDate="2021-02-19" transactionType="SALE" postingDate="2021-02-19"><Seller><Company>AHM Group</Company><Division>206500</Division></Seller><SubTotal>100.0</SubTotal><Total>108.25</Total><TotalTax>8.25</TotalTax><LineItem lineItemNumber="1"><Seller><AdministrativeOrigin taxAreaId="443810070"><StreetAddress1>4300 S Georgia St</StreetAddress1><City>AMARILLO</City><MainDivision>TX</MainDivision><PostalCode>79110-1722</PostalCode></AdministrativeOrigin></Seller><Customer><Destination taxAreaId="441130760"><StreetAddress1>1234 Main Street</StreetAddress1><City>DALLAS</City><MainDivision>TX</MainDivision><PostalCode>75201</PostalCode></Destination></Customer>';
             body += '<Product>00004</Product><Quantity>1.0</Quantity><FairMarketValue>-100.0</FairMarketValue><ExtendedPrice>-100.0</ExtendedPrice><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="35763">TEXAS</Jurisdiction><CalculatedTax>-6.25</CalculatedTax><EffectiveRate>0.0625</EffectiveRate><Taxable>-100.0</Taxable><Imposition impositionId="1">Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>18653</TaxRuleId><NominalRate>0.0625</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="CITY" jurisdictionId="77868">DALLAS</Jurisdiction><CalculatedTax>-1.0</CalculatedTax><EffectiveRate>0.01</EffectiveRate><Taxable>-100.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>26262</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="TRANSIT_DISTRICT" jurisdictionId="78120"><![CDATA[DALLAS METROPOLITAN TRANSIT AUTHORITY]]></Jurisdiction><CalculatedTax>-1.0</CalculatedTax>';
             body += '<EffectiveRate>0.01</EffectiveRate><Taxable>-100.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>26649</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><TotalTax>-8.25</TotalTax><FlexibleFields><FlexibleNumericField fieldId="2">3500</FlexibleNumericField></FlexibleFields><AssistedParameters><AssistedParameter paramName="FLEX.input.GVW" phase="PRE" ruleName="Set Vehicle Weight" originalValue="">3500</AssistedParameter></AssistedParameters></LineItem><LineItem lineItemNumber="2"><Seller><AdministrativeOrigin taxAreaId="443810070"><StreetAddress1>4300 S Georgia St</StreetAddress1><City>AMARILLO</City><MainDivision>TX</MainDivision><PostalCode>79110-1722</PostalCode></AdministrativeOrigin></Seller><Customer><Destination taxAreaId="441130760"><StreetAddress1>1234 Main St</StreetAddress1><City>DALLAS</City><MainDivision>TX</MainDivision><PostalCode>75201</PostalCode></Destination></Customer><Quantity>1.0</Quantity><FairMarketValue>200.0</FairMarketValue><ExtendedPrice>200.0</ExtendedPrice><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="35763">TEXAS</Jurisdiction>';
             body += '<CalculatedTax>12.5</CalculatedTax><EffectiveRate>0.0625</EffectiveRate><Taxable>200.0</Taxable><Imposition impositionId="1">Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>18653</TaxRuleId><NominalRate>0.0625</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="CITY" jurisdictionId="77868">DALLAS</Jurisdiction><CalculatedTax>2.0</CalculatedTax><EffectiveRate>0.01</EffectiveRate><Taxable>200.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>26262</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="TRANSIT_DISTRICT" jurisdictionId="78120"><![CDATA[DALLAS METROPOLITAN TRANSIT AUTHORITY]]></Jurisdiction><CalculatedTax>2.0</CalculatedTax><EffectiveRate>0.01</EffectiveRate><Taxable>200.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>';
             body += '<TaxRuleId>26649</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><TotalTax>16.5</TotalTax><FlexibleFields><FlexibleNumericField fieldId="2">3500</FlexibleNumericField></FlexibleFields><AssistedParameters><AssistedParameter paramName="FLEX.input.GVW" phase="PRE" ruleName="Set Vehicle Weight" originalValue="">3500</AssistedParameter></AssistedParameters></LineItem></QuotationResponse><ApplicationData><ResponseTimeMS>122.9</ResponseTimeMS></ApplicationData></VertexEnvelope></soapenv:Body></soapenv:Envelope>';        
             response.setBody(body); 
			}else if(reqBody.contains('InvoiceRequest')){
             String body = '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:9:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId>******</TrustedId></Login><InvoiceResponse documentDate="2021-02-19" transactionType="SALE" postingDate="2021-02-19"><Seller><Company>AHM Group</Company><Division>206500</Division></Seller><SubTotal>100.0</SubTotal><Total>108.25</Total><TotalTax>8.25</TotalTax><LineItem lineItemNumber="1"><Seller><AdministrativeOrigin taxAreaId="443810070"><StreetAddress1>4300 S Georgia St</StreetAddress1><City>AMARILLO</City><MainDivision>TX</MainDivision><PostalCode>79110-1722</PostalCode></AdministrativeOrigin></Seller><Customer><Destination taxAreaId="441130760"><StreetAddress1>1234 Main Street</StreetAddress1><City>DALLAS</City><MainDivision>TX</MainDivision><PostalCode>75201</PostalCode></Destination></Customer>';
             body += '<Product>00004</Product><Quantity>1.0</Quantity><FairMarketValue>-100.0</FairMarketValue><ExtendedPrice>-100.0</ExtendedPrice><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="35763">TEXAS</Jurisdiction><CalculatedTax>-6.25</CalculatedTax><EffectiveRate>0.0625</EffectiveRate><Taxable>-100.0</Taxable><Imposition impositionId="1">Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>18653</TaxRuleId><NominalRate>0.0625</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="CITY" jurisdictionId="77868">DALLAS</Jurisdiction><CalculatedTax>-1.0</CalculatedTax><EffectiveRate>0.01</EffectiveRate><Taxable>-100.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>26262</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="TRANSIT_DISTRICT" jurisdictionId="78120"><![CDATA[DALLAS METROPOLITAN TRANSIT AUTHORITY]]></Jurisdiction><CalculatedTax>-1.0</CalculatedTax>';
             body += '<EffectiveRate>0.01</EffectiveRate><Taxable>-100.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>26649</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><TotalTax>-8.25</TotalTax><FlexibleFields><FlexibleNumericField fieldId="2">3500</FlexibleNumericField></FlexibleFields><AssistedParameters><AssistedParameter paramName="FLEX.input.GVW" phase="PRE" ruleName="Set Vehicle Weight" originalValue="">3500</AssistedParameter></AssistedParameters></LineItem><LineItem lineItemNumber="2"><Seller><AdministrativeOrigin taxAreaId="443810070"><StreetAddress1>4300 S Georgia St</StreetAddress1><City>AMARILLO</City><MainDivision>TX</MainDivision><PostalCode>79110-1722</PostalCode></AdministrativeOrigin></Seller><Customer><Destination taxAreaId="441130760"><StreetAddress1>1234 Main St</StreetAddress1><City>DALLAS</City><MainDivision>TX</MainDivision><PostalCode>75201</PostalCode></Destination></Customer><Quantity>1.0</Quantity><FairMarketValue>200.0</FairMarketValue><ExtendedPrice>200.0</ExtendedPrice><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="35763">TEXAS</Jurisdiction>';
             body += '<CalculatedTax>12.5</CalculatedTax><EffectiveRate>0.0625</EffectiveRate><Taxable>200.0</Taxable><Imposition impositionId="1">Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>18653</TaxRuleId><NominalRate>0.0625</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="CITY" jurisdictionId="77868">DALLAS</Jurisdiction><CalculatedTax>2.0</CalculatedTax><EffectiveRate>0.01</EffectiveRate><Taxable>200.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType><TaxRuleId>26262</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><Taxes taxResult="TAXABLE" taxType="SELLER_USE" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="TRANSIT_DISTRICT" jurisdictionId="78120"><![CDATA[DALLAS METROPOLITAN TRANSIT AUTHORITY]]></Jurisdiction><CalculatedTax>2.0</CalculatedTax><EffectiveRate>0.01</EffectiveRate><Taxable>200.0</Taxable><Imposition impositionId="1">Local Sales and Use Tax</Imposition><ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>';
             body += '<TaxRuleId>26649</TaxRuleId><NominalRate>0.01</NominalRate></Taxes><TotalTax>16.5</TotalTax><FlexibleFields><FlexibleNumericField fieldId="2">3500</FlexibleNumericField></FlexibleFields><AssistedParameters><AssistedParameter paramName="FLEX.input.GVW" phase="PRE" ruleName="Set Vehicle Weight" originalValue="">3500</AssistedParameter></AssistedParameters></LineItem></InvoiceResponse><ApplicationData><ResponseTimeMS>122.9</ResponseTimeMS></ApplicationData></VertexEnvelope></soapenv:Body></soapenv:Envelope>';        
             response.setBody(body); 
         }else if(reqBody.contains('<urn:Country>null</urn:Country>')) //Negative response for VertexAddress cleansing
         {
            String body = '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><soapenv:Fault><faultcode>soapenv:Client</faultcode><faultstring xml:lang="en">Unknown country. Expecting an ISO Country Code - Alpha 3 (e.g., USA), or a well-known country name (e.g., United States of America). (country=null)</faultstring><detail><ns2:VertexException xmlns:ns2="urn:vertexinc:oseries:exception:1:0">';
            body +='<exceptionType>VertexInvalidCountryException</exceptionType><rootCause>Unknown country. Expecting an ISO Country Code - Alpha 3 (e.g., USA), or a well-known country name (e.g., United States of America). (country=null)&#xd;</rootCause></ns2:VertexException></detail></soapenv:Fault></soapenv:Body></soapenv:Envelope>';
            response.setBody(body);
         } else if(reqBody.contains('TaxAreaRequest')) //positive response for VertexAddress cleansing
         {   
             String body ='<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:9:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId>******</TrustedId></Login><TaxAreaResponse><TaxAreaResult taxAreaId="443810070" asOfDate="2021-05-26" confidenceIndicator="100"><Jurisdiction jurisdictionLevel="COUNTRY" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="1">UNITED STATES</Jurisdiction>';
  			 body += '<Jurisdiction jurisdictionLevel="STATE" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="35763">TEXAS</Jurisdiction><Jurisdiction jurisdictionLevel="COUNTY" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="37720">RANDALL</Jurisdiction><Jurisdiction jurisdictionLevel="CITY" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="77845">AMARILLO</Jurisdiction><Jurisdiction jurisdictionLevel="SPECIAL_PURPOSE_DISTRICT" effectiveDate="1998-01-20" expirationDate="9999-12-31" jurisdictionId="101565"><![CDATA[AMARILLO-POTTER EVENTS VENUE DISTRICT]]></Jurisdiction>';
             body += '<PostalAddress><StreetAddress1>4300 S Georgia St</StreetAddress1><City>Amarillo</City><MainDivision>TX</MainDivision><SubDivision>Randall</SubDivision><PostalCode>79110-1722</PostalCode><Country>USA</Country></PostalAddress>';
             body += '<Status lookupResult="NORMAL"/></TaxAreaResult></TaxAreaResponse><ApplicationData><ResponseTimeMS>26.2</ResponseTimeMS></ApplicationData></VertexEnvelope></soapenv:Body></soapenv:Envelope>';
             response.setBody(body); 
         }
            response.setStatusCode(200);
            return response; 
    }
}